Autodesk.Revit.UI.TabbedDialogExtension.SetContextualHelp(Autodesk.Revit.UI.ContextualHelp)
Sets the contextual help.
contextualHelp: The contextual help.
Since: 2013

Autodesk.Revit.UI.TabbedDialogExtension.GetContextualHelp
Gets the contextual help.
Returns: The contextual help assigned to the help button of the Revit options dialog, or null if there is no binding assigned.
Since: 2013

Autodesk.Revit.UI.TabbedDialogExtension.OnRestoreDefaultsAction
The restore defaults handler.
Remarks: This handler will be invoked when the "Restore Defaults" button in Revit options dialog is clicked
and the handler should apply only to options set on this page.
There is no "Restore Defaults" button in Revit options dialog if this property was set to null.
Since: 2013

Autodesk.Revit.UI.TabbedDialogExtension.OnCancelAction
The cancel handler.
Remarks: This handler will be invoked when the "Cancel" button in Revit options dialog is clicked.
The Revit options dialog will be closed directly if this property was set to null.
Since: 2013

Autodesk.Revit.UI.TabbedDialogExtension.OnOKAction
The ok handler.
Remarks: This handler will be invoked when the "Ok" button in Revit options dialog is clicked.
Since: 2013

Autodesk.Revit.UI.TabbedDialogExtension.Control
The control.
Since: 2013

Autodesk.Revit.UI.TabbedDialogExtension.#ctor(System.Windows.Controls.UserControl,Autodesk.Revit.UI.TabbedDialogAction)
Constructs a extension instance with a control and ok action handler.
userControl: The control.
onOK: The ok action handler.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when userControl or onOK
is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when userControl is already
bound to another tabbed dialog.
Since: 2013

Autodesk.Revit.UI.TabbedDialogExtension
Contains the information required to create and implement the behavior for the new tab inside
the Revit options dialog.
Remarks:
Each page has an associated user interface control and the handlers of buttons Cancel, Restore Defaults
and help can optionally be set. The size of the control is limited to 305 (height) x 288 (width) in physical pixels.
Since: 2013